In [1]:
!pip install pandas

Requirement already satisfied: pandas in /Users/grace/workspace/keras/venv/lib/python3.6/site-packages (0.22.0)
Requirement already satisfied: pytz>=2011k in /Users/grace/workspace/keras/venv/lib/python3.6/site-packages (from pandas) (2018.4)
Requirement already satisfied: python-dateutil>=2 in /Users/grace/workspace/keras/venv/lib/python3.6/site-packages (from pandas) (2.7.3)
Requirement already satisfied: numpy>=1.9.0 in /Users/grace/workspace/keras/venv/lib/python3.6/site-packages (from pandas) (1.14.4)
Requirement already satisfied: six>=1.5 in /Users/grace/workspace/keras/venv/lib/python3.6/site-packages (from python-dateutil>=2->pandas) (1.10.0)
textract 1.6.1 has requirement chardet==2.3.0, but you'll have chardet 3.0.4 which is incompatible.
spyder-kernels 0.2.6 has requirement ipykernel>=4.8.2, but you'll have ipykernel 4.8.1 which is incompatible.
spyder-kernels 0.2.6 has requirement jupyter-client>=5.2.3, but you'll have jupyter-client 5.2.2 which is incompatible.
spyder-kernels 0.2.6 has requirement pyzmq>=17, but you'll have pyzmq 16.0.4 which is incompatible.
You are using pip version 10.0.1, however version 18.1 is available.
You should consider upgrading via the 'pip install --upgrade pip' command.

In [2]:
import pandas as pd

### Pandas

- Series,
- Dataframe

In [4]:
company_a = [92600, 92400, 92100, 92300]
company_a

[92600, 92400, 92100, 92300]

In [5]:
company_a[0]

92600

In [7]:
company_a2 = pd.Series(company_a, index=['2018-11-01',
                           '2018-11-02',
                           '2018-11-03',
                           '2018-11-04'])

In [8]:
company_a2

2018-11-01    92600
2018-11-02    92400
2018-11-03    92100
2018-11-04    92300
dtype: int64

In [9]:
company_a2['2018-11-01']

92600

In [10]:
company_a2.index

Index(['2018-11-01', '2018-11-02', '2018-11-03', '2018-11-04'], dtype='object')

In [11]:
company_a2.values

array([92600, 92400, 92100, 92300])

## Series 인덱싱 연산

In [12]:
student1 = pd.Series([70, 80, 90], \
                     index=['math', 'english', 'science'])

In [13]:
student1

math       70
english    80
science    90
dtype: int64

In [16]:
student2 = pd.Series([60, 50, 40], \
                    index=['english', 'science', 'math'])

In [17]:
student2

english    60
science    50
math       40
dtype: int64

In [18]:
student1 + student2

english    140
math       110
science    140
dtype: int64

## Dataframe

In [19]:
student_grades = {'math':[70, 80, 90],
                 'english': [60, 50, 90],
                 'science':[50, 90, 80]}

In [20]:
student_grades

{'english': [60, 50, 90], 'math': [70, 80, 90], 'science': [50, 90, 80]}

In [21]:
pd.DataFrame(student_grades)

   english  math  science
0       60    70       50
1       50    80       90
2       90    90       80

In [23]:
df_grades = pd.DataFrame(student_grades, columns=['math', 'english', 'science'])

In [24]:
df_grades['math']

0    70
1    80
2    90
Name: math, dtype: int64

In [25]:
df_grades.math

0    70
1    80
2    90
Name: math, dtype: int64

In [26]:
test_data = ['18.10.01', '18.10.30', '18.11.01']

In [29]:
df_test = pd.DataFrame(student_grades, columns=['math', 'english', 'science'], index=test_data)
df_test

          math  english  science
18.10.01    70       60       50
18.10.30    80       50       90
18.11.01    90       90       80

In [33]:
df_test.loc['18.10.01', 'math']

70

In [34]:
df_test.loc['18.11.09'] = [90, 90, 90]

In [35]:
df_test

          math  english  science
18.10.01    70       60       50
18.10.30    80       50       90
18.11.01    90       90       80
18.11.09    90       90       90

# at, iat

In [31]:
df_test.at['18.10.01', 'math']

70

In [32]:
df_test.iat[0, 0]

70

## slice

In [36]:
test_list = [1, 2, 4, 5]

In [37]:
test_list[0]

1

In [39]:
test_list[:2]

[1, 2]

In [41]:
test_list[-3:]

[2, 4, 5]

In [42]:
df_test.loc['18.10.01':'18.11.09', 'math':'english']

          math  english
18.10.01    70       60
18.10.30    80       50
18.11.01    90       90
18.11.09    90       90

In [44]:
df_test.loc['18.10.01', :]

math       70
english    60
science    50
Name: 18.10.01, dtype: int64

In [45]:
df_test.iloc[0:2]

          math  english  science
18.10.01    70       60       50
18.10.30    80       50       90

In [46]:
df_test.iloc[:, 2]

18.10.01    50
18.10.30    90
18.11.01    80
18.11.09    90
Name: science, dtype: int64

# Filtering

In [47]:
df_test.filter(items=['math', 'english'])

          math  english
18.10.01    70       60
18.10.30    80       50
18.11.01    90       90
18.11.09    90       90

In [51]:
df_test[df_test.english > 60]

          math  english  science
18.11.01    90       90       80
18.11.09    90       90       90

In [52]:
df_test[df_test.english > 60]['english']

18.11.01    90
18.11.09    90
Name: english, dtype: int64

# index reset

In [55]:
df_test.reset_index(inplace=True)

In [56]:
df_test

      index  math  english  science
0  18.10.01    70       60       50
1  18.10.30    80       50       90
2  18.11.01    90       90       80
3  18.11.09    90       90       90

In [57]:
df_test.rename(columns={'index':'date'}, inplace=True)

In [58]:
df_test

       date  math  english  science
0  18.10.01    70       60       50
1  18.10.30    80       50       90
2  18.11.01    90       90       80
3  18.11.09    90       90       90

# 컬럼 추가

In [59]:
df_test['avg'] = df_test.mean(axis=1)

In [60]:
df_test

       date  math  english  science        avg
0  18.10.01    70       60       50  60.000000
1  18.10.30    80       50       90  73.333333
2  18.11.01    90       90       80  86.666667
3  18.11.09    90       90       90  90.000000

In [61]:
df_test.mean(axis=0)

math       82.5
english    72.5
science    77.5
avg        77.5
dtype: float64

# sorting

In [62]:
df_test.sort_values(['avg'], ascending=False)

       date  math  english  science        avg
3  18.11.09    90       90       90  90.000000
2  18.11.01    90       90       80  86.666667
1  18.10.30    80       50       90  73.333333
0  18.10.01    70       60       50  60.000000

# map

In [63]:
def get_letter_grade(grade):
    if grade >= 90:
        return 'A'
    elif grade >= 80:
        return 'B'
    else:
        return 'C'

In [64]:
get_letter_grade(90)

'A'

In [65]:
df_test

       date  math  english  science        avg
0  18.10.01    70       60       50  60.000000
1  18.10.30    80       50       90  73.333333
2  18.11.01    90       90       80  86.666667
3  18.11.09    90       90       90  90.000000

In [66]:
df_test.math.map(lambda x: get_letter_grade(x))

0    C
1    B
2    A
3    A
Name: math, dtype: object

In [69]:
list(map(lambda x: get_letter_grade(x), [90, 70, 80]))

['A', 'C', 'B']

In [79]:
list(map(lambda x: get_letter_grade(x), df_test.math))

['C', 'B', 'A', 'A']

## Apply

In [70]:
df_test.apply(lambda x: (x['math']+x['english']+x['science'])/3, \
              axis=1)

0    60.000000
1    73.333333
2    86.666667
3    90.000000
dtype: float64

In [73]:
df_test.apply(lambda x: ', '.join([
    get_letter_grade(x['math']),
    get_letter_grade(x['english']),
    get_letter_grade(x['science'])
]), axis=1)

0    C, C, C
1    B, C, A
2    A, A, B
3    A, A, A
dtype: object

## applymap

In [74]:
df_test

       date  math  english  science        avg
0  18.10.01    70       60       50  60.000000
1  18.10.30    80       50       90  73.333333
2  18.11.01    90       90       80  86.666667
3  18.11.09    90       90       90  90.000000

In [75]:
df_test_letters = df_test.loc[:, 'math':'avg']
df_test_letters

   math  english  science        avg
0    70       60       50  60.000000
1    80       50       90  73.333333
2    90       90       80  86.666667
3    90       90       90  90.000000

In [76]:
df_test_letters.applymap(lambda x: get_letter_grade(x))

  math english science avg
0    C       C       C   C
1    B       C       A   C
2    A       A       B   B
3    A       A       A   A

## Query

In [77]:
df_test.query('math>80')

       date  math  english  science        avg
2  18.11.01    90       90       80  86.666667
3  18.11.09    90       90       90  90.000000